{
    "badges": [
        {
            "name": "agents",
            "flags": [
                {
                    "answer": "foo",
                    "number": 0,
                    "name": "Written text test",
                    "challenge": "Example text entry flag",
                    "completed": false,
                    "extra_info": "Extra flag details",
                    "code": "text-entry",
                    "completed_timestamp": "2021-04-01 11:09:41",
                    "resettable": "False"
                },
                {
                    "number": 1,
                    "name": "Local agent",
                    "challenge": "Demonstrate your ability to deploy an agent on local host. The agent should successfully beacon back to this server instance.",
                    "completed": false,
                    "extra_info": "An agent is another name for Remote Access Trojan (RAT). These programs, written in any language, execute an adversary's instructions on compromised computers. Often, an agent will communicate back to the adversary through an internet protocol, such as HTTP, UDP or DNS. Agents give adversaries remote-control access of the computer running it.",
                    "code": "GEVTGOBZGQZSWMI=",
                    "completed_timestamp": "2021-04-01 11:09:41",
                    "resettable": "False"
                },
                {
                    "number": 2,
                    "name": "Remote agent",
                    "challenge": "Demonstrate your ability to deploy an agent on a remote host. The agent should successfully beacon back to this server instance. This agent should be run on an operating system that is NOT the same as what is hosting the server. It is OK to use a virtual box to complete this challenge.",
                    "completed": false,
                    "extra_info": "Adversaries will most likely deploy their command-and-control (C2) server somewhere Internet accessible. This means their agents will need to have access to the C2 IP address. Computers often have unrestricted outbound Internet connectivity but heavily restricted inbound connectivity, which is why it's usually best to have an agent connect to you, not vice-versa.",
                    "code": "GIVTAKZQ",
                    "completed_timestamp": "",
                    "resettable": "False"
                },
                {
                    "number": 3,
                    "name": "Understanding trust",
                    "challenge": "Change the untrusted agent timer to 60 seconds.",
                    "completed": false,
                    "extra_info": "Agents beacon into the C2 on a regular basis, asking the adversary if there are new instructions. If a beacon misses a regularly scheduled interval, there is a chance the agent itself has been discovered and compromised. Defenders may attempt to reverse-engineer the agent and restart it with the intent of learning how it works.",
                    "code": "GMVTAKZQ",
                    "completed_timestamp": "",
                    "resettable": "False"
                },
                {
                    "number": 4,
                    "name": "Update agent",
                    "challenge": "Pick any agent and change the group and sleep (min and max) values associated to it.",
                    "completed": false,
                    "extra_info": "If an agent's beacon time is too regular - or predictable - it runs a higher chance of getting caught. It is advisable to select a random time range instead of a hard-coded interval. Usually, an adversary will aim to have multiple agents deployed on a host, with some frequent beacon times and some infrequent. This gives them a backup in case one gets detected.",
                    "code": "GQVTAKZQ",
                    "completed_timestamp": "",
                    "resettable": "False"
                },
                {
                    "number": 5,
                    "name": "Agent filename",
                    "challenge": "Ensure that new agents will be named \"super_scary\" when downloaded on any host. Note that the extension is automatically appended if necessary.",
                    "completed": false,
                    "extra_info": "Adversaries try to blend in when they compromise a host. One common tactic is to name their agent after a program that is already running on the host. When defenders check process lists and file names, the name has a higher chance of blending in.",
                    "code": "GUVTAKZQ",
                    "completed_timestamp": "",
                    "resettable": "False"
                },
                {
                    "number": 6,
                    "name": "Bootstrap abilities",
                    "challenge": "Using a Stockpile ability, ensure new agents automatically run \"whoami\" on their first beacon. Locate the ability that executes this command and enter the ability id as a bootstrap ability (Hint: Abilities and their id can be found in the `plugins/stockpile/data/abilities` directory).",
                    "completed": false,
                    "extra_info": "Depending on the defensive tools installed on a compromised machine, an adversary may need to execute their mission quickly before getting detected and shut down. One common tactic is to give each new agent a set of instructions to run immediately after sending the first beacon in. These instructions may determine what software is installed on the host, to gain persistence or any another tactic.",
                    "code": "GYVTAKZQ",
                    "completed_timestamp": "",
                    "resettable": "False"
                },
                {
                    "number": 7,
                    "name": "Contact points",
                    "challenge": "Deploy a new agent, using a different contact point then your first agent",
                    "completed": false,
                    "extra_info": "If an adversary deploys all of their agents on a host using the same protocol, say HTTP, then when their agent is detected and shut down, the defenders will likely close access to the C2 over that protocol. Therefore, an adversary will want multiple agents on a host, each using a different protocol to talk to the C2.",
                    "code": "G4VTAKZQ",
                    "completed_timestamp": "",
                    "resettable": "False"
                },
                {
                    "number": 8,
                    "name": "Kill agent",
                    "challenge": "Kill one of your agents through the GUI",
                    "completed": false,
                    "extra_info": "In red-team engagements, operators often need to clean up the environments under test at the end of the testing. Going through box-by-box can be time-consuming, so using automation to auto-stop agents is preferred.",
                    "code": "HAVTAKZQ",
                    "completed_timestamp": "",
                    "resettable": "False"
                }
            ]
        },
        {
            "name": "adversaries",
            "flags": [
                {
                    "number": 9,
                    "name": "Create adversary",
                    "challenge": "Create a new adversary named \"Certifiable\" with at least 3 abilities",
                    "completed": false,
                    "extra_info": "An adversary usually executes their attack in a specific order, one technique at a time. It's \n    common to start with discovery - or recon - of what is on the compromised host. Then moving to collection, \n    persistence or lateral-movement, an adversary continues on.",
                    "code": "HEVTAKZQ",
                    "completed_timestamp": "",
                    "resettable": "False"
                },
                {
                    "number": 10,
                    "name": "Combine adversaries",
                    "challenge": "Add the Nosy Neighbor adversary to the Certifiable adversary and save it",
                    "completed": false,
                    "extra_info": "A TTP is often connected to a series of other TTPs to form an attack. For example, an adversary may \n    have a procedure for locating all PDF files on a host. This may be followed by a procedure to exfiltrate all the \n    found files. In CALDERA, this chain of TTPs being used is considered an adversary.",
                    "code": "GEYCWMBLGA======",
                    "completed_timestamp": "",
                    "resettable": "False"
                },
                {
                    "number": 11,
                    "name": "Create ability",
                    "challenge": "Create a new ability from the UI named \"My test ability\" and add it to the Certifiable adversary. Put it under the discovery tactic and include a command to execute and a cleanup command. Have the command print out the network interfaces and IP addresses on the host. Hint: this would be \"ifconfig\" on a MacOS.",
                    "completed": false,
                    "extra_info": "Being able to create TTPs quickly and swap them in and out is a valuable skill. Adversaries use a\n     TTP until it is no longer effective - and then they write new versions, make modifications or switch techniques\n     entirely.",
                    "code": "GEYSWMBLGA======",
                    "completed_timestamp": "",
                    "resettable": "False"
                }
            ]
        },
        {
            "name": "operations",
            "flags": [
                {
                    "number": 12,
                    "name": "Basic operation",
                    "challenge": "Run and finish an operation. Use the Hunter adversary profile provided in the Stockpile plugin.",
                    "completed": false,
                    "extra_info": "An autonomous operation uses an adversary profile to pre-configures the attack. Agents and C2 run without operator interference. This allows operators to run repeatable adversary emulation exercises, ensuring that each one is identical to the last.",
                    "code": "GEZCWMBLGA======",
                    "completed_timestamp": "",
                    "resettable": "False"
                },
                {
                    "number": 13,
                    "name": "Stealthy operation",
                    "challenge": "Run and finish an operation using a jitter of 10/20 and base64 obfuscation. Use the Hunter adversary profile provided in the Stockpile plugin again.",
                    "completed": false,
                    "extra_info": "Adding a random sleep time (jitter) between each command an agent runs is equally as important for staying undetected as is using random beacon intervals.\nAnother way to stay undetected is to obfuscate commands. Defenders will often write monitors to detect specific keywords used on a host. If an adversary obfuscates their commands, they can bypass this sort of detection tactic.",
                    "code": "GEZSWMBLGA======",
                    "completed_timestamp": "",
                    "resettable": "False"
                },
                {
                    "number": 14,
                    "name": "Manual operation",
                    "challenge": "Run and finish an operation using any adversary profile except Hunter. Run the operation requiring manual approval. Approve and discard links as desired.",
                    "completed": false,
                    "extra_info": "During an adversary emulation exercise, operators may want to approve every command before it is tasked to an agent and executed. Operations requiring manual approval ensures that that no commands are run that the operator does not want run.",
                    "code": "GE2CWMBLGA======",
                    "completed_timestamp": "",
                    "resettable": "False"
                },
                {
                    "number": 15,
                    "name": "Empty operation",
                    "challenge": "Run and finish an operation without selecting any agent groups or adversary profiles. Add at least 5 manual or potential links to the operation before finishing the operation.",
                    "completed": false,
                    "extra_info": "During an autonomous adversary emulation exercise, the operation will only run tasks in the adversary profile. Manual and potential links allow an operator to \"toss in\" additional TTPs into a live, autonomous operation.",
                    "code": "GE2SWMBLGA======",
                    "completed_timestamp": "",
                    "resettable": "False"
                }
            ]
        },
        {
            "name": "advanced",
            "flags": [
                {
                    "number": 16,
                    "name": "Update configs",
                    "challenge": "Update the app.contact.http configuration property to an externally-facing IPv4 address",
                    "completed": false,
                    "extra_info": "C2 servers need to be made accessible to agents, either through agent-network-facing interfaces or proxies. Changing the app.contact.http configuration value sets the URL that agents will connect to with the HTTP  contact.",
                    "code": "GE3CWMBLGA======",
                    "completed_timestamp": "",
                    "resettable": "False"
                },
                {
                    "number": 17,
                    "name": "Adjust sources",
                    "challenge": "Create a new fact source called \"better basic\" with at least 1 fact and 1 rule",
                    "completed": false,
                    "extra_info": "Fact sources are used to seed an operation with facts and put rules in place to determine which facts will be saved during the operation.",
                    "code": "GE3SWMBLGA======",
                    "completed_timestamp": "",
                    "resettable": "False"
                },
                {
                    "number": 18,
                    "name": "Add new user",
                    "challenge": "Add new red-team user credentials, using \"test\" as both the username and password.",
                    "completed": false,
                    "extra_info": "During an adversary emulation operation, multiple users may need access to the CALDERA server.\nThis flag requires making direct changes to the configuration file at conf/local.yml. Make sure the server is turned off before editing this file, or else changes will be overwritten.",
                    "code": "GE4CWMBLGA======",
                    "completed_timestamp": "",
                    "resettable": "False"
                }
            ]
        },
        {
            "name": "manx",
            "flags": [
                {
                    "number": 19,
                    "name": "Manx plugin",
                    "challenge": "Start a new Manx agent on your localhost. Then send at least 2 commands to it through the reverse-shell session. Then run a normal operation against the agent using the Hunter profile.",
                    "completed": false,
                    "extra_info": "One of the most common activities a red-team operator will attempt to do is gain a reverse-shell on a compromised host. This type of shell is a persistent (usually via TCP) connection which gives the operator a terminal experience that is as-if they are sitting behind the keyboard on the remote host.",
                    "code": "GE4SWMBLGA======",
                    "completed_timestamp": "",
                    "resettable": "False"
                },
                {
                    "number": 20,
                    "name": "Manx UDP",
                    "challenge": "Start a new Manx agent in UDP mode",
                    "completed": false,
                    "extra_info": "If an adversary is having trouble getting an agent to connect outbound over popular protocols, like HTTP or TCP, they will often fallback to UDP. Because DNS goes over UDP, this protocol is usually more accessible than others. In addition, lazy system administrators may forget to add firewall rules on UDP ports whereas TCP is the default in most firewall tools.",
                    "code": "GIYCWMBLGA======",
                    "completed_timestamp": "",
                    "resettable": "False"
                }
            ]
        },
        {
            "name": "mock",
            "flags": [
                {
                    "number": 21,
                    "name": "Mock plugin",
                    "challenge": "Enable the mock plugin. Then run an operation against the \"simulation\" group using the Hunter profile.",
                    "completed": false,
                    "extra_info": "Testing out attacks ahead of time ensures a high chance of success during a real operation. This can be cumbersome if the test requires a test lab with varying operating systems. Simulating the responses of various TTPs is a good way to quickly get a feel for how an attack may play out.",
                    "code": "GIYSWMBLGA======",
                    "completed_timestamp": "",
                    "resettable": "False"
                }
            ]
        },
        {
            "name": "response",
            "flags": [
                {
                    "number": 22,
                    "name": "Blue agent",
                    "challenge": "Log in as a blue user and deploy a new blue agent. The agent should successfully beacon back to this server instance. Blue agents should be run with elevated privileges.",
                    "completed": false,
                    "extra_info": "Most Endpoint Detection and Response products use agents that are installed on the endpoints that need to be protected. Sandcat can function as Caldera's Blue agent too.",
                    "code": "GIZCWMBLGA======",
                    "completed_timestamp": "",
                    "resettable": "False"
                },
                {
                    "number": 23,
                    "name": "Blue operation",
                    "challenge": "Using the machine with the blue agent, connect to a listener on another machine listening on TCP port 7011. This can be done using Netcat on *nix machines, or TcpClient on Windows machines.Then, run a blue operation using the blue agent group, the 'Incident responder' defender, the batch planner and the response fact source.",
                    "completed": false,
                    "extra_info": "EDR agents are intended to run at all times while the endpoint is running. To simulate this, agents can be registered on endpoints to automatically run when the endpoint is booted. Defenders can also be instructed to run continuously through the use of Repeatable abilities.",
                    "code": "GIZSWMBLGA======",
                    "completed_timestamp": "",
                    "resettable": "False"
                }
            ]
        },
        {
            "name": "gameboard",
            "flags": [
                {
                    "number": 24,
                    "name": "GameBoard plugin",
                    "challenge": "Run a red-blue exercise. Create a red operation named \"Gameboard - Red\", and a blue operation named \"Gameboard - Blue\". View the results in the Gameboard plugin.",
                    "completed": false,
                    "extra_info": "Purple-teaming is the process of running a red-team engagement in conjunction with the blue-team. It is often fruitful to provide some - but not all - of the details between the red and blue teams. This allows both sides to train against each other.",
                    "code": "GI2CWMBLGA======",
                    "completed_timestamp": "",
                    "resettable": "False"
                }
            ]
        }
    ]
}